import matplotlib.pyplot as plt
#准备绘制数据
x = ["0", "4", "8", "12", "16","20","24"]
y = [0.764 , 0.756 , 0.729 , 0.730 , 0.732 , 0.731 , 0.723]

x2 = ["0", "4", "8", "12", "16","20","24"]
y2 = [0.965 , 0.982 , 0.979 , 0.943 , 0.975 , 0.929 , 0.948]

x3 = ["0", "4", "8", "12", "16","20","24"]
y3 = [0.822,0.798,0.788,0.790,0.782,0.739,0.767]

x4 = ["0", "4", "8", "12", "16","20","24"]
y4 = [0.862,0.867,0.884,0.851,0.879,0.808,0.830]

x5 = ["0", "20", "40", "60", "80","100"]
y5 = [0.99971,0.999989659,0.9999946654,0.9999981433,0.879,0.808]

x6 = ["0", "20", "40", "60", "80","100"]
y6 = [0.8841,0.9583,0.9909,0.9975,0.879,0.808]

x7 = ["0", "20", "40", "60", "80","100"]
y7 = [0.7812,0.924,0.9884,0.9943,0.879,0.808]

x8 = ["0", "20", "40", "60", "80","100"]
y8 = [0.7455,0.9047,0.9875,0.9893,0.879,0.808]

x9 = ["0", "20", "40", "60", "80","100"]
y9 = [0.7455,0.9047,0.9875,0.9893,0.879,0.808]

xm1 = ["5", "10", "15", "20"]
ym1 = [0.6881,0.75,0.7698,0.9097,0.879,0.808]

xm2 = ["5", "10", "15", "20"]
ym2 = [0.276,0.2864,0.2885,0.3258,0.879,0.808]

xm3 = ["5", "10", "15", "20"]
ym3 = [0.2704,0.2786,0.2824,0.3016,0.879,0.808]

xm4 = ["0", "5", "10", "15", "20"]
ym4 = [0.2543,0.2682,0.2675,0.2873,0.879,0.808]

xm5 = ["0", "5", "10", "15", "20"]
ym5 = [0.2546,0.2663,0.2658,0.2791,0.879,0.808]

# "g" 表示红色，marksize用来设置'D'菱形的大小
plt.plot(x, y, "g", marker='D', markersize=5, label="K=4")
plt.plot(x2, y2, "r", marker='D', markersize=5, label="K=1")
plt.plot(x3, y3, "b", marker='D', markersize=5, label="K=3")
plt.plot(x4, y4, "darkgray", marker='D', markersize=5, label="K=2")
#绘制坐标轴标签
plt.xlabel("epoch")
plt.ylabel("AP")
plt.title("SmoothAP")
#显示图例
plt.legend(loc="lower left",frameon=True,ncol=2)
#调用 text()在图像上绘制注释文本
#x1、y1表示文本所处坐标位置，ha参数控制水平对齐方式, va控制垂直对齐方式，str(y1)表示要绘制的文本
for x1, y1 in zip(x, y):
    plt.text(x1, y1, str(y1), ha='center', va='bottom', fontsize=10)

for x1, y1 in zip(x2, y2):
    plt.text(x1, y1, str(y1), ha='center', va='bottom', fontsize=10)

for x1, y1 in zip(x3, y3):
    plt.text(x1, y1, str(y1), ha='center', va='bottom', fontsize=10)

for x1, y1 in zip(x4, y4):
    plt.text(x1, y1, str(y1), ha='center', va='bottom', fontsize=10)
#保存图片
plt.savefig("1.jpg")
plt.show()